<a href="https://colab.research.google.com/github/R-Guerra/Estudo/blob/main/Criando_e_Manipulando_uma_Planilha_do_Excel_com_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Criação e Manipulação de uma Planilha do Excel por meio da Biblioteca Pandas.

A) Por meio de um notebook, ou do prompt do Python (é necessário já ter instalado o Python no seu computador) vamos importar a biblioteca Pandas, dica use o comando “import pandas as pd”, por exemplo;

In [ ]:
import pandas as pd

B) Agora com a planilha salva em uma pasta conhecida do seu computador vamos ler os dados para uma variável que podemos chamar de df, por exemplo, em referência ao seu tipo, Data Frame, ou outro nome a sua escolha, dica, use o comando “df = read_excel (<pasta_e_nome_do_arquivo>)”; 
-- Tive problemas para carregar o arquivo dessa forma, então fiz o upload de uma forma diferente --

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving Tabela Trabalho.xlsx to Tabela Trabalho.xlsx

In [ ]:
import io
df = pd.read_excel(io.BytesIO(uploaded['Tabela Trabalho.xlsx']))

C) Agora vamos ler as 5 primeiras e as 3 últimas linhas da planilha com usando os métodos head e tail do Pandas;

In [ ]:
df.head(5)

   ID    Nome         Área  Cadastro   Telefone          Cidade Estado    País
0   1  Allana          T.I       201  994657783  Rio de Janeiro     RJ  Brasil
1   2  Cíntia         Arte       202  943238897  Rio de Janeiro     RJ  Brasil
2   3    Yago  Gastronomia       203  975653498          Suzano     SP  Brasil
3   4    Iago    Filosofia       204  914563784           Jaíba     MG  Brasil
4   5    Luan     História       205  967352435      Vila Velha     ES  Brasil

In [ ]:
df.tail(3)

    ID      Nome  Área  Cadastro   Telefone  Cidade Estado    País
77  78    Isaura  Arte       278  946758777  Jordão     AC  Brasil
78  79  Gildásio  Arte       279  900884433  Jordão     AC  Brasil
79  80    Amanda  Arte       280  977366644   Feijó     AC  Brasil

D) Descubra o método que nos mostra um relatório resumido da nossa planilha, neste momento, do nosso data frame e anote a saída em seu relatório;

In [ ]:
df.count

<bound method DataFrame.count of     ID      NOME         ÁREA  CAD.       TEL.          CIDADE ESTADO    PAÍS
0    1    Allana          T.I   201  994657783  Rio de Janeiro     RJ  Brasil
1    2    Cíntia         Arte   202  943238897  Rio de Janeiro     RJ  Brasil
2    3      Yago  Gastronomia   203  975653498          Suzano     SP  Brasil
3    4      Iago    Filosofia   204  914563784           Jaíba     MG  Brasil
4    5      Luan     História   205  967352435      Vila Velha     ES  Brasil
..  ..       ...          ...   ...        ...             ...    ...     ...
75  76    Arthur     História   276  956654433      Vila Velha     ES  Brasil
76  77   Leôncio     História   277  922774488      Vila Velha     Es  Brasil
77  78    Isaura         Arte   278  946758777          Jordão     AC  Brasil
78  79  Gildásio         Arte   279  900884433          Jordão     AC  Brasil
79  80    Amanda         Arte   280  977366644           Feijó     AC  Brasil

[80 rows x 8 columns]>

E) Agora vamos adicionar o próprio data frame a atual data frame, e vamos conferir que seu tamanho realmente duplicou como de esperado, após relatar isso, podemos eliminar as duplicações, dica de comando, vejam: append, shape e drop_duplicates;

In [ ]:
df.shape

(80, 8)

In [ ]:
df.append(df)

    ID      Nome         Área  ...          Cidade  Estado    País
0    1    Allana          T.I  ...  Rio de Janeiro      RJ  Brasil
1    2    Cíntia         Arte  ...  Rio de Janeiro      RJ  Brasil
2    3      Yago  Gastronomia  ...          Suzano      SP  Brasil
3    4      Iago    Filosofia  ...           Jaíba      MG  Brasil
4    5      Luan     História  ...      Vila Velha      ES  Brasil
..  ..       ...          ...  ...             ...     ...     ...
75  76    Arthur     História  ...      Vila Velha      ES  Brasil
76  77   Leôncio     História  ...      Vila Velha      Es  Brasil
77  78    Isaura         Arte  ...          Jordão      AC  Brasil
78  79  Gildásio         Arte  ...          Jordão      AC  Brasil
79  80    Amanda         Arte  ...           Feijó      AC  Brasil

[160 rows x 8 columns]

In [ ]:
df.drop_duplicates()

    ID      Nome         Área  ...          Cidade  Estado    País
0    1    Allana          T.I  ...  Rio de Janeiro      RJ  Brasil
1    2    Cíntia         Arte  ...  Rio de Janeiro      RJ  Brasil
2    3      Yago  Gastronomia  ...          Suzano      SP  Brasil
3    4      Iago    Filosofia  ...           Jaíba      MG  Brasil
4    5      Luan     História  ...      Vila Velha      ES  Brasil
..  ..       ...          ...  ...             ...     ...     ...
75  76    Arthur     História  ...      Vila Velha      ES  Brasil
76  77   Leôncio     História  ...      Vila Velha      Es  Brasil
77  78    Isaura         Arte  ...          Jordão      AC  Brasil
78  79  Gildásio         Arte  ...          Jordão      AC  Brasil
79  80    Amanda         Arte  ...           Feijó      AC  Brasil

[80 rows x 8 columns]

F) Vamos agora imprimir os nomes atuais das colunas, com o comando columns, e depois renomear algumas destas colunas, com o comando rename, e imprimir novamente os nomes das colunas para termos a certeza que foram alterados com o comando da forma que queríamos;

In [ ]:
df.columns

Index(['ID', 'Nome', 'Área', 'Cadastro', 'Telefone', 'Cidade', 'Estado',
       'País'],
      dtype='object')

In [ ]:
df.rename(columns={
    'Cadastro' : 'Cad.',
    'Telefone' : 'Tel.'
}, inplace=True)

In [ ]:
df.columns

Index(['ID', 'Nome', 'Área', 'Cad.', 'Tel.', 'Cidade', 'Estado', 'País'], dtype='object')

G) Agora seguindo a apostila acrescente mais três comandos usando métodos do Pandas e anote as saídas no relatório que deverá ser enviado nesta tarefa.

In [ ]:
df.columns = [col.upper() for col in df]

In [ ]:
df.columns

Index(['ID', 'NOME', 'ÁREA', 'CAD.', 'TEL.', 'CIDADE', 'ESTADO', 'PAÍS'], dtype='object')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      80 non-null     int64
 1   NOME    80 non-null     object
 2   ÁREA    80 non-null     object
 3   CAD.    80 non-null     int64
 4   TEL.    80 non-null     int64
 5   CIDADE  80 non-null     object
 6   ESTADO  80 non-null     object
 7   PAÍS    80 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.1+ KB

In [ ]:
df.count()

ID        80
NOME      80
ÁREA      80
CAD.      80
TEL.      80
CIDADE    80
ESTADO    80
PAÍS      80
dtype: int64